arduino/ArduinoCore-zephyr/boards.txt
frdm_mcxn947.name=NXP FRDM MCXN947
frdm_mcxn947.build.core=arduino
frdm_mcxn947.build.crossprefix=arm-zephyr-eabi-
frdm_mcxn947.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

frdm_mcxn947.menu.debug.false=Standard
frdm_mcxn947.menu.debug.true=Debug
frdm_mcxn947.menu.debug.true.build.zsk_args.debug=-debug

frdm_mcxn947.menu.link_mode.dynamic=Dynamic
frdm_mcxn947.menu.link_mode.static=Static
frdm_mcxn947.menu.link_mode.static.build.link_mode=static
frdm_mcxn947.menu.link_mode.static.upload.extension=bin-zsk.bin

frdm_mcxn947.build.zephyr_target=frdm_mcxn947//cpu0
frdm_mcxn947.build.zephyr_args=
frdm_mcxn947.build.zephyr_hals=hal_nxp
frdm_mcxn947.build.variant=frdm_mcxn947_mcxn947_cpu0
frdm_mcxn947.build.mcu=cortex-m33
frdm_mcxn947.build.fpu=-mfpu=fpv5-sp-d16
frdm_mcxn947.build.architecture=cortex-m33

frdm_mcxn947.build.float-abi=-mfloat-abi=hard
frdm_mcxn947.build.extra_flags=
frdm_mcxn947.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
frdm_mcxn947.build.board=FRDM_MCXN947
frdm_mcxn947.vid.0=0x1fc9
frdm_mcxn947.pid.0=0x0143
frdm_mcxn947.upload_port.0.vid=0x1fc9
frdm_mcxn947.upload_port.0.pid=0x0143
frdm_mcxn947.upload.address=0x100F0000
frdm_mcxn947.upload.target=mcxn947vdf

frdm_mcxn947.upload.tool=pyocd
frdm_mcxn947.upload.tool.default=pyocd
frdm_mcxn947.upload.protocol=
frdm_mcxn947.upload.transport=
frdm_mcxn947.upload.vid=0x1fc9
frdm_mcxn947.upload.pid=0x0143
frdm_mcxn947.upload.interface=0
frdm_mcxn947.upload.use_1200bps_touch=false
frdm_mcxn947.upload.wait_for_upload_port=false
frdm_mcxn947.upload.native_usb=true
frdm_mcxn947.upload.maximum_size=1966080
frdm_mcxn947.upload.maximum_data_size=523624

frdm_mcxn947.bootloader.tool=pyocd
frdm_mcxn947.bootloader.tool.default=pyocd
frdm_mcxn947.bootloader.file=zephyr-{build.variant}.elf
frdm_mcxn947.bootloader.target=mcxn947vdf


##########################################################################################

portentah7.name=Arduino Portenta H7
portentah7.build.core=arduino
portentah7.build.crossprefix=arm-zephyr-eabi-
portentah7.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

portentah7.menu.debug.false=Standard
portentah7.menu.debug.true=Debug
portentah7.menu.debug.true.build.zsk_args.debug=-debug

portentah7.menu.link_mode.dynamic=Dynamic
portentah7.menu.link_mode.static=Static
portentah7.menu.link_mode.static.build.link_mode=static
portentah7.menu.link_mode.static.upload.extension=bin-zsk.bin

portentah7.build.zephyr_target=arduino_portenta_h7@1.0.0//m7
portentah7.build.zephyr_args=
portentah7.build.zephyr_hals=hal_stm32 hal_infineon
portentah7.build.artifact=zephyr_main
portentah7.build.variant=arduino_portenta_h7_stm32h747xx_m7
portentah7.build.mcu=cortex-m7
portentah7.build.fpu=-mfpu=fpv5-d16
portentah7.build.architecture=cortex-m7

portentah7.build.float-abi=-mfloat-abi=softfp
portentah7.build.extra_flags=
portentah7.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentah7.build.architecture=cortex-m7
portentah7.build.board=PORTENTA_H7_M7
portentah7.vid.0=0x2341
portentah7.pid.0=0x005b
portentah7.upload_port.0.vid=0x2341
portentah7.upload_port.0.pid=0x035b

portentah7.upload.tool=dfu-util
portentah7.upload.tool.default=dfu-util
portentah7.upload.protocol=
portentah7.upload.transport=
portentah7.upload.vid=0x2341
portentah7.upload.pid=0x035b
portentah7.upload.interface=0
portentah7.upload.use_1200bps_touch=true
portentah7.upload.wait_for_upload_port=true
portentah7.upload.native_usb=true
portentah7.upload.maximum_size=1966080
portentah7.upload.maximum_data_size=523624

portentah7.upload.address=0x080E0000

portentah7.upload.maximum_size=786432
portentah7.upload.maximum_data_size=523624

portentah7.bootloader.tool=dfu-util
portentah7.bootloader.tool.default=dfu-util
portentah7.bootloader.vid=0x2341
portentah7.bootloader.pid=0x035b
portentah7.bootloader.interface=0
portentah7.bootloader.file=zephyr-{build.variant}.bin
portentah7.bootloader.address=0x08040000

portentah7.debug.tool=gdb
portentah7.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
portentah7.debug.server.openocd.scripts.1={programmer.transport_script}
portentah7.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
portentah7.debug.cortex-debug.custom.request=attach
portentah7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##############################################################################################################

frdm_rw612.name=NXP FRDM RW612
frdm_rw612.build.core=arduino
frdm_rw612.build.crossprefix=arm-zephyr-eabi-
frdm_rw612.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

frdm_rw612.menu.debug.false=Standard
frdm_rw612.menu.debug.true=Debug
frdm_rw612.menu.debug.true.build.zsk_args.debug=-debug

frdm_rw612.menu.link_mode.dynamic=Dynamic
frdm_rw612.menu.link_mode.static=Static
frdm_rw612.menu.link_mode.static.build.link_mode=static
frdm_rw612.menu.link_mode.static.upload.extension=bin-zsk.bin

frdm_rw612.build.zephyr_target=frdm_rw612
frdm_rw612.build.zephyr_args=
frdm_rw612.build.zephyr_hals=hal_stm32
frdm_rw612.build.variant=frdm_rw612_rw612
frdm_rw612.build.mcu=cortex-m33+nodsp
frdm_rw612.build.fpu=-mfpu=fpv5-sp-d16
frdm_rw612.build.architecture=cortex-m33+nodsp

frdm_rw612.build.float-abi=-mfloat-abi=hard
frdm_rw612.build.extra_flags=
frdm_rw612.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
frdm_rw612.build.board=FRDM_RW612
frdm_rw612.vid.0=0x1fc9
frdm_rw612.pid.0=0x0143
frdm_rw612.upload_port.0.vid=0x1fc9
frdm_rw612.upload_port.0.pid=0x0143
frdm_rw612.upload.address=0x18323000
frdm_rw612.upload.target=rw612

frdm_rw612.upload.tool=pyocd
frdm_rw612.upload.tool.default=pyocd
frdm_rw612.upload.protocol=
frdm_rw612.upload.transport=
frdm_rw612.upload.vid=0x1fc9
frdm_rw612.upload.pid=0x0143
frdm_rw612.upload.interface=0
frdm_rw612.upload.use_1200bps_touch=false
frdm_rw612.upload.wait_for_upload_port=false
frdm_rw612.upload.native_usb=true
frdm_rw612.upload.maximum_size=1966080
frdm_rw612.upload.maximum_data_size=523624

frdm_rw612.bootloader.tool=pyocd
frdm_rw612.bootloader.tool.default=pyocd
frdm_rw612.bootloader.file=zephyr-{build.variant}.elf
frdm_rw612.bootloader.target=rw612

##########################################################################################

niclasense.name=Arduino Nicla Sense ME
niclasense.build.core=arduino
niclasense.build.crossprefix=arm-zephyr-eabi-
niclasense.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

niclasense.menu.link_mode.dynamic=Dynamic
niclasense.menu.link_mode.static=Static
niclasense.menu.link_mode.static.build.link_mode=static
niclasense.menu.link_mode.static.upload.extension=bin-zsk.bin

